import * as React from "react";

const UsdIcon = (props: any) => (
    <svg
        xmlns="http://www.w3.org/2000/svg"
        width={24}   // Растягивает SVG по ширине компонента
        height={24}   // Растягивает SVG по высоте компонента
        viewBox="0 0 10 13"  // Устанавливает масштаб и координаты внутри SVG
        fill="none"
        {...props}
    >
        <path
            fill="#32E55E"
            d="M5.28 13.003H4.27v-.952C2.087 11.912.725 10.762.718 9.034h1.787c.066.835.732 1.428 1.765 1.545v-3.2l-.703-.176C1.875 6.793.952 5.796.952 4.332c0-1.729 1.245-2.857 3.318-3.04V.282h1.01v1.01c1.978.176 3.253 1.355 3.29 3.003H6.818c-.022-.776-.645-1.392-1.538-1.509v3.04l.725.153c1.846.44 2.754 1.377 2.754 2.923 0 1.824-1.267 2.959-3.48 3.135v.966Zm1.7-3.91c0-.806-.535-1.29-1.7-1.524v3.025c1.077-.066 1.7-.623 1.7-1.502ZM2.754 4.184c0 .732.527 1.223 1.516 1.428V2.78c-.879.051-1.516.63-1.516 1.406Z"
        />
    </svg>
);

export default UsdIcon;
